grades = {
    0: '不限',
    1: '小学一年级',
    2: '小学二年级',
    3: '小学三年级',
    4: '小学四年级',
    5: '小学五年级',
    6: '预备(小学六年级)',
    7: '初中一年级',
    8: '初中二年级',
    9: '初中三年级',
    10: '高中一年级',
    11: '高中二年级',
    12: '高中三年级',
}

subjects = {
    0: '不限',
    1: '语文',
    2: '数学',
    3: '英语',
    4: '物理',
    5: '化学',
    6: '生物',
    7: '政治',
    8: '历史',
    9: '地理',
}

diffs = {
    0: '不限',
    1: '简单',
    2: '中等',
    3: '难',
}

types = {
    0: '不限',
    1: '填空题',
    2: '单选题',
    3: '多选题',
    4: '应用题',
    5: '综合题',
}

source = {
    0: '不限',
    1: '上海市',
    2: '黄浦区',
    4: '徐汇区',
    5: '长宁区',
    6: '静安区',
    7: '普陀区',
    8: '虹口区',
    9: '杨浦区',
    10: '浦东新区',
    11: '闵行区',
    12: '宝山区',
    13: '嘉定区',
    14: '金山区',
    15: '松江区',
    16: '青浦区',
    17: '奉贤区',
    18: '崇明区',
}